shop/modules/controllers/CategoryController.php

SELECT * FROM `shop_category` WHERE parentid = '6'
---
   public function actionEdit()
   {
     $this->layout = "layout1";
     $id = Yii::$app->request->get('cateid');
     $model = Category::find()->where('cateid = :id',[':id'=>$id])->one();