shop/modules/controllers/OrderController.php

SELECT COUNT(*) FROM `shop_order`
SELECT * FROM `shop_order` LIMIT 6
---
    public function actionList()
    {
     // 订单编号   下单人     收货地址    快递方式    订单总价    商品列表    订单状态    操作
     $this->layout = 'layout1';
     $model = Order::find();
     $count = $model->count();
     $pageSize = Yii::$app->params['mypageSize']['order'];
     $pager = new Pagination(['totalCount'=>$count,'pageSize'=>$pageSize]);
     $data = $model->offset($pager->offset)->limit($pager->limit)->all();

SELECT * FROM `shop_user` WHERE userid = '21'
SELECT * FROM `shop_address` WHERE addressid = '18'
SELECT * FROM `shop_order` WHERE orderid = '103'
---
    public function actionDetail()
    {

      $this->layout = 'layout1';
      $data = [];
      if (Yii::$app->request->isGet) {
        $orderid = Yii::$app->request->get('orderid');
        if ($orderid) {
          $data['orderid'] = $orderid;
          $ordermodel = Order::find()->where('orderid = :oid',[':oid'=>$orderid])->one();
          $username = User::find()->where('userid = :uid',[':uid' =>$ordermodel->userid] )->one()->username;
          $data['username'] = $username;
          $data['address']=Address::find()->where('addressid = :oid',[':oid'=>$ordermodel->addressid])->one()->address;