shop/modules/controllers/ProductController.php

    public function actionList()
    {
       $this->layout = 'layout1';
        $model = Product::find();
        $count = $model->count();
        //$pageSize = Yii::$app->params['pageSize']['product'];
        $pageSize =6;
        $pager = new Pagination(['totalCount' => $count, 'pageSize' => $pageSize]);
        $products = $model->offset($pager->offset)->limit($pager->limit)->all();
---
SELECT COUNT(*) FROM `shop_product`
SELECT * FROM `shop_product` LIMIT 6

    public function actionMod()
    {
        $this->layout = 'layout1';
        // $model = new Product;
        $cates = new Category;
        $opts = $cates->getOptions();
        $id = Yii::$app->request->get('productid');
        if (!empty($id)) {
        $model = Product::find()->where('productid = :id',[':id'=>$id])->one();
---
SELECT * FROM `shop_product` WHERE productid = '3'

    public function actionDel()
    {
     $pid = Yii::$app->request->get('productid');
     $model = Product::find()->where('productid= :pid',[':pid'=>$pid])->one();
---
SELECT * FROM `shop_product` WHERE productid= '2'

    public function actionOn()
    {
     $pid = Yii::$app->request->get('productid');
     Product::updateAll(['isOn'=>'1'],'productid = :pid',[':pid'=>$pid]);
---
UPDATE `shop_product` SET `isOn`='1' WHERE productid = '2'