shop/modules/controllers/UserController.php

    public function actionUsers()
    {
        $this->layout = "layout1";
        $user_model   = User::find()->joinWith('profile');
        // 联合查询 2017年2月3日
        $count    = $user_model->count();
        $pageSize = Yii::$app->params['mypageSize']['user'];
        $pager    = new Pagination(['totalCount' => $count, 'pageSize' => $pageSize]);
        $users    = $user_model->offset($pager->offset)->limit($pager->limit)->all();
---
SELECT COUNT(*) FROM `shop_user` LEFT JOIN `shop_profile` ON `shop_user`.`userid` = `shop_profile`.`userid`
SELECT * FROM `shop_profile` WHERE `userid` IN ('1', '2')
SELECT `shop_user`.* FROM `shop_user` LEFT JOIN `shop_profile` ON `shop_user`.`userid` = `shop_profile`.`userid` LIMIT 10