shop/models/Address.php

    public function add($data)
    {
        if ($this->load($data) && $this->save()) {
---
INSERT INTO `shop_address` (`firstname`, `lastname`, `postcode`, `email`, `telephone`) VALUES ('æ\Ž', 'ç™\½', '017000', '162777@163.com', '15239876789')