shop/models/Category.php

    public function getData()
    {
       $data = self::find()->all();
---
SELECT * FROM `shop_category`

    public static function getMenu()
    {
        // 便利获取顶级分类
        $top = self::find()->where('parentid = :pid', [":pid" => 0])->limit(11)->orderby('createtime asc')->asArray()->all();
        $data = [];
        // 获取子集分类
        foreach((array)$top as $k=>$cate) {
            $cate['children'] = self::find()->where("parentid = :pid", [":pid" => $cate['cateid']])->limit(10)->asArray()->all();
---
SELECT * FROM `shop_category` WHERE parentid = 0 ORDER BY `createtime` LIMIT 11
SELECT * FROM `shop_category` WHERE parentid = '1' LIMIT 10