shop/models/Order.php

      public static function getProducts($userid)
    {
        $orders = self::find()->where('status > 0 and userid = :uid', [':uid' => $userid])->orderBy('createtime desc')->all();
        foreach($orders as $order) {
            $details = OrderDetail::find()->where('orderid = :oid', [':oid' => $order->orderid])->all();
            $products = [];
            foreach($details as $detail) {
                $product = Product::find()->where('productid = :pid', [':pid' => $detail->productid])->one();
                if (empty($product)) {
                    continue;
                }
                $product->num = $detail->productnum;
                $product->price = $detail->price;
                $product->cate = Category::find()->where('cateid = :cid', [':cid' => $product->cateid])->one()->title;
---
SELECT * FROM `shop_order` WHERE status > 0 and userid = '21' ORDER BY `createtime` DESC
SELECT * FROM `shop_order_detail` WHERE orderid = '104'
SELECT * FROM `shop_product` WHERE productid = '3'
SELECT * FROM `shop_category` WHERE cateid = '14'