shop/models/User.php

SELECT EXISTS(SELECT * FROM `shop_user` WHERE `useremail`='lydxhw64375@chacuo.net')
---
    public function validatePass()
    {
        if (!$this->hasErrors()) {
           $loginname = "username";
           $data = self::find()->where($loginname.' = :loginname and userpass = :pass', [':loginname' => $this->loginname, ':pass' => md5($this->userpass)])->one();


           if (preg_match('/@/',$this->loginname)) {
               $loginname="useremail";

           //这个语句很重要 但是太陌生
            $data = self::find()->where($loginname.' = :loginname and userpass = :pass', [':loginname' => $this->useremail, ':pass' => md5($this->userpass)])->one();

INSERT INTO `shop_user` (`username`, `useremail`, `userpass`, `createtime`) VALUES ('tset@qq.com', 'test2@qq.com', '098f6bcd4621d373cade4e832627b4f6', '1488208663')
---
    public function reg($data, $scenario = 'reg')
    {
        $this->scenario = $scenario;
        //首先进行数据加载进行验证数据是否正确
        //2017年1月29日 20:49:43
        //！！！！！$this->validate() 无参数！！
        if ($this->load($data) && $this->validate()) {
            $this->createtime = time();