shop/models/User.php

INSERT INTO `shop_user` (`useremail`, `createtime`, `userpass`, `username`) VALUES ('lydxhw64375@chacuo.net', '1486176940', 'd41d8cd98f00b204e9800998ecf8427e', NULL)
---
    public function reg($data, $scenario = 'reg')
    {
        $this->scenario = $scenario;
        //首先进行数据加载进行验证数据是否正确
        //2017年1月29日 20:49:43
        //！！！！！$this->validate() 无参数！！
        if ($this->load($data) && $this->validate()) {
            $this->createtime = time();
            $this->userpass   = md5($this->userpass);
            if ($this->save(false)) {