shop/modules/models/Admin.php

    public function validatePass()
    {

        if (!$this->hasErrors()) {
            $data = self::find()->where('adminuser = :user and adminpass = :pass', [':user' => $this->adminuser, ':pass' => md5($this->adminpass)])->one();
---
SELECT * FROM `shop_admin` WHERE adminuser = 'boy' and adminpass = '202cb962ac59075b964b07152d234b70'

    public function login($data)
    {
        $this->scenario = 'login';
        if ($this->load($data) && $this->validate()) {
            $lifetime = $this->RemberMe ? 24 * 3600 : 0;
            $session  = Yii::$app->session;
            session_set_cookie_params($lifetime);
            $session['admin'] = [
                'adminuser' => $this->adminuser,
                'isLogin'   => 1,
            ];
            // 数据更新操作
            $this->updateAll(['logintime' => time(), 'loginip' => ip2long(Yii::$app->request->userIP)], 'adminuser = :user', [':user' => $this->adminuser]);
---
UPDATE `shop_admin` SET `logintime`='1487605399', `loginip`='2130706433' WHERE adminuser = 'boy'