shop/controllers/AddressController.php

    public function actionAdd()
    {
        if (!Yii::$app->session['isLogin']) {
          return $this->redirect(['member/auth']);
        }
        // 判明是否登录
        // $orderid = Yii::$app->request->get('orderid');
        $username = Yii::$app->session['loginname'];
        $userid= User::find()->where('username= :name or useremail = :email',[':name'=>$username,':email'=>$username])->one()->userid;
---
SELECT * FROM `shop_user` WHERE username= 'cc' or useremail = 'cc'

    public function actionDel()
    {
        if (!Yii::$app->session['isLogin']) {
          return $this->redirect(['member/auth']);
        }
        // 判明是否登录
        // $orderid = Yii::$app->request->get('orderid');
        $username = Yii::$app->session['loginname'];
        $userid= User::find()->where('username= :name or useremail = :email',[':name'=>$username,':email'=>$username])->one()->userid;
        $addressid = Yii::$app->request->get('addressid');
        //判断用户是否是属于同一个人
        if (!Address::find()->where('userid = :uid and username = :name',[':uid'=>$userid,':name'=>$username])) {
            throw new \Exception('数据校验错误');
        }
        Address::deleteAll('addressid = :aid',[':aid'=>$addressid]);
---
SELECT * FROM `shop_user` WHERE username= 'cc' or useremail = 'cc'
DELETE FROM `shop_address` WHERE addressid = '17'