shop/controllers/CartController.php

    public function actionIndex()
    {
     $this->layout = 'layout1';
     //判断用户是否登录
     if (Yii::$app->session['isLogin'] !=1 ) {
        $this->redirect(['member/auth']);
     }
     // 获取登录用户名称
     $name = Yii::$app->session['loginname'];
     $userid = User::find()->where('username = :name',[':name'=>$name])->one()->userid;
     // 根据用户名称获取购物车
     $cart = Cart::find()->where('userid = :id',[':id'=>$userid])->asArray()->all();
     //asArray()函数获取的数据是一个多维数组 注意判断处理
     $data= [];
     // $k显示为 0 1
     foreach ($cart as $k => $pro) {
      // 查询到对应商品
          $product = Product::find()->where('productid = :pid',[':pid'=>$pro['productid']])->one();
---
SELECT * FROM `shop_user` WHERE username = 'cc'
SELECT * FROM `shop_cart` WHERE userid = '21'
SELECT * FROM `shop_product` WHERE productid = '3'

    public function actionAdd()
    {
        //判断是否登录用户
       if (!Yii::$app->session['isLogin']) {
          return  $this->redirect(['member/auth']);
       }
       // 获取用户名称
       $name = Yii::$app->session['loginname'];
       $userid = User::find()->where('username = :name',[':name'=>$name])->one()->userid;
       // var_dump($userid);
       // exit();
        //分情况处理 post方法
        if (Yii::$app->request->isPost) {
            $post = Yii::$app->request->post();
            $num  = Yii::$app->request->post()['productnum'];
            $data['Cart'] = $post;
            $data['Cart']['userid'] = $userid;
        }
        // get方法
       if (Yii::$app->request->isGet) {
           $productid = Yii::$app->request->get('productid');
           $model = Product::find()->where('productid = :pid',[':pid'=>$productid])->one();
           $price = $model->issale ? $model->saleprice :$model->price;
           $num = 1;
           $data['Cart'] = ['productid' => $productid, 'productnum' => $num, 'price' => $price, 'userid' => $userid];
       }
        //购物车 数据查找
       $model = Cart::find()->where('productid = :pid and userid = :uid',[':pid'=>$data['Cart']['productid'],':uid'=>$data['Cart']['userid']])->one();
---
SELECT * FROM `shop_user` WHERE username = 'cc'
SELECT * FROM `shop_product` WHERE productid = '4'
SELECT * FROM `shop_cart` WHERE productid = '3' and userid = '21'

     public function actionMod()
    {
      //ajax 通信GET方法获取数字
      $cartid = Yii::$app->request->get('cartid');
      $productnum = Yii::$app->request->get('productnum');
      // echo $cartid;exit();
      // 刷新数据
      Cart::updateAll(['productnum'=>$productnum],'cartid = :cid',
        [':cid' => $cartid]);
---
UPDATE `shop_cart` SET `productnum`='268' WHERE cartid = '1'

    public function actionDel()
    {
      $cartid = Yii::$app->request->get('cartid');
      // 删除数据
      Cart::deleteAll('cartid = :cid',[':cid'=>$cartid]);
---
DELETE FROM `shop_cart` WHERE cartid = NULL