shop/controllers/OrderController.php

INSERT INTO `shop_order` (`userid`, `status`, `createtime`) VALUES ('21', '0', '1492580182')
---
    public function actionAdd()
    {
        if (!Yii::$app->session['isLogin']) {
          return $this->redirect(['member/auth']);
        }
        //开始事务处理 防止回滚
        //2017年3月4日 16:22:13
        $transaction = Yii::$app->db->beginTransaction();
        try{
           if (Yii::$app->request->isPost) {
            $postdata = Yii::$app->request->post();
            $ordermodel = new Order;
            $ordermodel->scenario = 'add';
            $username = Yii::$app->session['loginname'];
            // echo 'username:'.$username.'<br>';
            $usermodel= User::find()->where('username= :name or useremail = :email',[':name'=>$username,':email'=>$username])->one();

            if (!$usermodel) {
               throw new \Exception("无此用户");
               // echo 'user bad';
            }
            $userid = $usermodel->userid;
            $ordermodel->userid = $userid;
            $ordermodel->status =  Order::CREATEORDER;
            $ordermodel->createtime = time();