shop/controllers/OrderController.php

SELECT * FROM `shop_order` WHERE orderid = '101'
SELECT * FROM `shop_user` WHERE username= 'cc' or useremail = 'cc'
SELECT * FROM `shop_address` WHERE userid = '21'
SELECT * FROM `shop_order_detail` WHERE orderid = '101'
SELECT * FROM `shop_product` WHERE productid = '3'
---
    public function actionCheck()
    {
        if (!Yii::$app->session['isLogin']) {
          return $this->redirect(['member/auth']);
        }
        // 判明是否登录
        $orderid = Yii::$app->request->get('orderid');
        // $status = Order::find()->where('userid = :id',['id'=>$orderid])->one()->status;
        $status = Order::find()->where('orderid = :oid', [':oid' => $orderid])->one()->status;
        if ($status != Order::CREATEORDER && $status != Order::CHECKORDER) {
            return $this->redirect(['order/index']);
        }
        // 获取订单ID
        $username = Yii::$app->session['loginname'];
        $usermodel= User::find()->where('username= :name or useremail = :email',[':name'=>$username,':email'=>$username])->one();
        if (!$usermodel) {
               throw new \Exception("无此用户");
               // echo 'user bad';
        }
        $userid = $usermodel->userid;
        //得到用户ID
        $addresses = Address::find()->where('userid = :uid', [':uid' => $userid])->asArray()->all();
        //获取用户地址
        $details = OrderDetail::find()->where('orderid = :oid', [':oid' => $orderid])->asArray()->all();
        // 获取订单详情
        $data = [];
        foreach($details as $detail) {
            $model = Product::find()->where('productid = :pid' , [':pid' => $detail['productid']])->one();

SELECT * FROM `shop_user` WHERE username= 'cc' or useremail = 'cc'
SELECT * FROM `shop_order` WHERE userid = '21' and orderid = '101'
SELECT * FROM `shop_order_detail` WHERE orderid = '101'
---
    public function actionConfirm()
    {

        if (!Yii::$app->session['isLogin']) {
          return $this->redirect(['member/auth']);
        }

        try {
        // 获取订单ID
        $username = Yii::$app->session['loginname'];
        $userid= User::find()->where('username= :name or useremail = :email',[':name'=>$username,':email'=>$username])->one()->userid;
        // $addressid = Address::find()->where('userid = :uid',[':uid']=>$userid)->getPrimaryKey();
         $addressmodel = new Address;
         $addressid = $addressmodel->getPrimaryKey();
        if (!$userid) {
               throw new \Exception("无此用户");
               // echo 'user bad';
           }
        if (Yii::$app->request->ispost) {
                $post = Yii::$app->request->post();
                $orderid = $post['orderid'];
                $model = Order::find()->where('userid = :uid and orderid = :oid',[':uid'=>$userid,':oid'=>$orderid])->one();
                if (!$model) {
                    throw new Exception("订单错误！");
                }
                $details = OrderDetail::find()->where('orderid = :oid',[':oid'=>$orderid])->all();

SELECT * FROM `shop_user` WHERE username= 'cc' or useremail = 'cc'
---
    public function actionIndex()
    {
        $this->layout = "layout2";
              if (!Yii::$app->session['isLogin']) {
          return $this->redirect(['member/auth']);
        }
        // 判明是否登录
        $orderid = Yii::$app->request->get('orderid');
        // 获取订单ID
        $username = Yii::$app->session['loginname'];
        $usermodel= User::find()->where('username= :name or useremail = :email',[':name'=>$username,':email'=>$username])->one();